engl360/application.tex
% Created 2022-01-25 Tue 10:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jacskon}
\date{\today}
\title{Job Application Packet}
\hypersetup{
 pdfauthor={Jacskon},
 pdftitle={Job Application Packet},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Parts of assignment}
\label{sec:orgca4c74e}
\begin{itemize}
\item One-page resume tailored specifically for the job to which you are applying
\item 4 paragraph cover letter addressed to the hiring manager
\item One-page memo addressed to prof detialing the chosen job's activites
\item Rational about why I am quialified
\item The salary range of the job in my area
\item Also Included
\begin{itemize}
\item The job advertisement
\item Mock online interview via Big Interview
\end{itemize}
\end{itemize}
\end{document}
